{
  "basics": {
    "name": "John Fogarty",
    "label": "Director / Cloud Systems Architect",
    "picture": "",
    "email": "johnafogarty4@gmail.com",
    "phone": "925.456.4604",
    "website": "http://www.rlgeex.com",
    "summary": "A distinguished Director of IT and Systems Architect with expertise in a very diverse range of technology.  Demonstrated success managing individuals, teams, projects, and complicated system designs.  Delivering projects on time, is a result of a very organized and results driven individual with a proven ability to implement standards, procedures, and processes. Demonstrates strong leadership skills while leading teams to higher levels of productivity and creating a more coheisve team environment.",
    "location": {
      "address": "9345 Cougar Ct.",
      "postalCode": "VA 20111",
      "city": "Manassas Park",
      "countryCode": "US",
      "region": "Virginia"
    },
    "profiles": [
      {
        "network": "Github",
        "username": "johnafogarty4",
        "url": "https://github.com/johnafogarty4"
      },
      {
        "network": "Twitter",
        "username": "@johnafogarty4",
        "url": "https://twitter.com/johnafogarty4"
      },
      {
        "network": "Linkedin",
        "username": "johnafogarty4",
        "url": "https://www.linkedin.com/in/johnafogarty4/"
      }
    ]
  },
  "work": [
    {
      "company": "Livingston International",
      "position": "Director, IT - Global Systems",
      "website": "http://www.livingstonintl.com",
      "startDate": "2016-04-12",
      "summary": "In 2014 I was promoted over a group of Systems Administrators that were struggling to see a future outside of our MSP.  In that time we have expanded our on premise non MSP server environment 200% and our AWS cloud based environment 400%.",
      "highlights": [
        "Developed, implemented, and led our team to automate infrastructure deployments.",
        "Created Livingston International's Infrastructure as Code standard, utilizing Terraform, Packer, and Cloudformation.",
        "Developed Livingston International's linux packer images for use with Terraform",
        "Lowered costs by consolidating older datacenters from past aquisitions into our new Equinix Datacenters.",
        "Lowered cloud costs by moving workloads that are not cloud friendly into our Equinix datacenters.",
        "Lowered cloud costs by implementing an in house devloped instance scheduler for all non-production systems.",
        "Deployed a Zabbix monitoring environment with 2000+ hosts and proxies at edge locations.",
        "Worked with product development teams to architect a robust, highly available platforms to be accessed by customers.",
        "Worked with development leaders to support our emerging CI/CD workflow with Jenkins, CodeCommit, CodePipeline & CodeBuild.",
        "Created Livingston International's standard of requireing all software installed in cloud instances be through CodeDeploy."
      ]
    },
    {
      "company": "Livingston International",
      "position": "Senior Systems Architect - Cloud",
      "website": "http://www.livingstonintl.com",
      "startDate": "2015-01-05",
      "endDate": "2016-04-12",
      "summary": "Provide architectural & technical guidance on AWS Cloud & On Premises environments for the enterprise.",
      "highlights": [
        "Created Livingston International's AWS cloud footprint growing to more than 20 accounts across 4 regions.",
        "Created Livingston International's standard for deploying to AWS using Cloudformation.",
        "Created Livingston International's standard for deploying systems to AWS using EC2, RDS, and ECS.",
        "Multi-AZ VPC, Transit Gateway, Direct Connect, DMVPN Backup to on-prem.",
        "Designed and deployed Livingston International's new Equinix datacenters in Ashburn, VA and Toronto, Ontario.",
        "Deployed UCS in each of the two new datacenters with iScsi HPE Nimble HF SAN.",
        "Deployed EMC VxRail appliance in each of the two new datacenters.",
        "Re-designed the corporate Oracle footprint in AWS with RDS & EC2 where necessary.",
        "Migrated & Decommissioned 6+ disparate data centers into DC3 & TR2 on Cisco UCS.",
        "Worked with gathering requirements from several product development teams and architected robust, highly available platforms for which product lines would be hosted and accessed by customers."
      ]
    },
    {
      "company": "Health Information Designs",
      "position": "Manager of Infrastructure",
      "website": "http://hidesigns.com/",
      "startDate": "2014-04-01",
      "endDate": "2015-01-01",
      "summary": "Lead a team of 3 Linux engineers through the process of moving to highly available on-premise systems.",
      "highlights": [
        "Managed a team of 3 Linux engineers, responsible for the infrastructure including Load Balancers, Firewalls, Windows servers, Linux Servers, and VMWare servers.",
        "Designed new clustered virtualization infrastructure to eliminate single points of failure.",
        "Completed cloud feasibility study with multiple cloud and IAAS vendors to determine if it made financial sense to migrate from on premise equipment into the cloud.",
        "Designed new Active Directory implementation to replace aging and misconfigured Active Directory.",
        "Implemented disaster recovery plan and automation with HID's two largest products."
      ]
    },
    {
      "company": "Transaction Network Services",
      "position": "Manager Linux Systems",
      "website": "http://www.tnsi.com/",
      "startDate": "2013-04-01",
      "endDate": "2014-04-01",
      "summary": "Managed a team of 4 Linux engineers, responsible for VMWare and Linux VMs in the US, Europe, and Asia.",
      "highlights": [
        "Designed new ESXi 5.1 infrastructure and implemented it in TNS' new Datacenter in Ashburn VA.",
        "Managed the migration and moving of 750+ systems from TNS' Datacenter in Reston, VA to Ashburn VA, including 561 VMs, 9 VMWare clusters made up of 27 hosts.",
        "Deployed Catbird Security solution for VMWare in the UK.",
        "Standardized VMWare configuration across enterprise (150+ VMware hosts).",
        "Evaluated & Scoped VCAC automation suite for an enterprise.",
        "Managing VMWare & UCS compute platforms with PowerShell.",
        "Implemented automated Disaster Recovery on Virtualized platforms.",
        "Designed and Implemented Clustered vCenter per geographic region, migrated from 18 vCenters to 6. The three regions were, North America, Europe and Asia.",
        "Deployed Windows System Center Operations Manager to monitor VM Hypervisors, UCS compute Platforms & EMC Storage Platforms."
      ]
    },
    {
      "company": "Transaction Network Services",
      "position": "Senior Unix Systems Administrator",
      "website": "http://www.tnsi.com/",
      "startDate": "2012-05-01",
      "endDate": "2013-04-01",
      "summary": "Provide deep experience in VMware and introduce new standards for use at TNS.",
      "highlights": [
        "Designed and deployed an updated lab infrastructure using ESXi 5.0 and vCloud director.",
        "Standardized on UCS blades for Compute Platform, migrated from HP proliant rack servers.",
        "Implemented standards for all Linux VMs including naming, partitioning, package install, and logging settings.",
        "Implemented centralized repository for VMWare and Linux patch installations.",
        "Scoped out project to enable VMWare chargeback and VCOps for full deployment at TNS worldwide.",
        "Standardized on Authentication scheme using MS Active Directory and Centrify Direct Control.",
        "Designed & Implemented VMWare update strategy using the VMWare update manager."
      ]
    },
    {
      "company": "Northrop Grumman Corporation",
      "position": "Systems Engineer",
      "website": "https://www.northropgrumman.com/",
      "startDate": "2006-08-01",
      "endDate": "2012-05-01",
      "summary": "Systems Engineer responsiple for maintaining servers and special projects.",
      "highlights": [
        "Scaled out the EIDE infrastructure to support over 100 programs, with 11,000 unique users, and a combined value of 300 billion dollars in potential contracts.",
        "Designed, implemented, and migrated all users to new XenApp 6.5 Citrix farm.",
        "Migrated all VMs for the EIDE environment from ESX 3.5 to new ESX 4.0 clusters with limited downtime.",
        "Designed and implemented EIDE environment based on The Zone.  This included one of the first implementations of VMware 3.5 at Northrop Grumman.",
        "Designed and implemented a colloboration environment (The Zone) supporting more than 45 programs with a combined value of 150 billion dollars in potential contracts.  Awarded the IS Presidents award for this environment.",
        "Designed and implemented a Citrix 4.0 Xenapp environment to support 140 users.",
        "Designed and implemented a small virtual environment for development testing."
      ]
    },
    {
      "company": "Imperium Staffing",
      "position": "Systems Administrator",
      "website": "",
      "startDate": "2005-10-01",
      "endDate": "2006-06-01",
      "summary": "Provide systems administrator services to Perot Systems clients.",
      "highlights": [
        "Administered, maintained, and supported a client with 500+ servers.",
        "Designed and implemented a Virtual Server environment.",
        "Clustered Microsoft Virtual Server environment for developing new applications, and testing existing applications before rolling them out into production.",
        "Clustered Microsoft Virtual Server solution for internal and external domain controllers, saving the client $50,000 in hardware costs.",
        "Re-engineered the production Citrix environment to improve efficiency and uptime.",
        "Re-engineered the development Citrix environment to match the production Citrix environment."
      ]
    },
    {
      "company": "PepsiCo",
      "position": "Systems Engineer (Desktop)",
      "website": "http://www.pepsico.com/",
      "startDate": "2003-08-01",
      "endDate": "2005-08-01",
      "summary": "Lead engineer on a team of 5, supporting all client devices used by PepsiCo employees.",
      "highlights": [
        "Responsible for designing and implementing PepsiCo's common Windows XP scripted and image-based installs for 30,000+ desktop and laptop computers.",
        "Evaluated, engineered, and rolled out the Toshiba Portege 3500 and Toshiba Portege M200 for PepsiCo's tablet computing needs.",
        "Facilitated weekly meetings with the help desk to discuss issues with Windows XP in an effort to create solutions to reduce call volume and duration.",
        "Developed and led multiple Windows XP training classes with the help desk to help PepsiCo plan for the transition of support from Windows NT to Windows XP.",
        "Developed and supported the process to Convert 1,300 computers at Quaker and Tropicana from Windows NT to Windows XP.",
        "Designed and implemented Active Directory policies for PepsiCo client PCs to allow greater control and stability of the operating system through the use of group policies.",
        "Designed and implemented PepsiCo's Microsoft Software Update Services (SUS) environment to maintain the security patch level of all Windows XP laptops and desktops.",
        "Re-engineered PepsiCo's SNA mainframe connectivity complex to run on vendor supported hardware and software.",
        "Principal project engineer for the My Access project to deliver a employee self-service kiosk solution for manufacturing sites and other locations with limited or non-PepsiCo computers - allowing employees to complete yearly benefit enrollment and manage HR-related information via computer."
      ]
    },
    {
      "company": "PepsiCo Production Certification Lab",
      "position": "Systems Administrator",
      "website": "http://www.pepsico.com/",
      "startDate": "2001-08-01",
      "endDate": "2003-08-01",
      "summary": "Lead tester for all infrastructure changes including Windows NT Workstation 4.0, Windows NT Server 4.0, OS/2 Warp Server 3.0, and Lotus Notes Server version 4.5.",
      "highlights": [
        "Consistently completed projects ahead of schedule and with a high degree of customer satisfaction.",
        "Implemented changes in the testing procedures to streamline the process and reduce cycle time.",
        "Designed and implemented a Ghost Image process to streamline application testing which reduced testing time by an average of 40%.",
        "Provided intra-team training and documentation on the Ghost product suite.",
        "Trained a team of professionals on various infrastructure components that were used to emulate PepsiCo field sites including servers, desktops, laptops, network switches, routers, Windows NT 4.0 workstation, Windows NT 4.0 Server, OS/2 Server 3.0, OS/2 Warp 4.0 for workstations.",
        "Upgraded and added additional equipment to more accurately emulate field sites for application and infrastructure component testing which reduced the number of errors during rollouts by 25%."
      ]
    },{
      "company": "PepsiCo Critical Situations Team",
      "position": "Support Engineer",
      "website": "http://www.pepsico.com/",
      "startDate": "1999-07-01",
      "endDate": "2001-08-01",
      "summary": "Provided third level support for all PepsiCo and Frito-Lay field locations.",
      "highlights": [
        "Implemented the idea of \"Education Hour\".  A meeting every week that lasted anywhere from thirty minutes to two hours where at each meeting a different person would share information they learned over the course of the month with the rest of the team which resulted in a more efficient team and backup capabilities."
      ]
    },{
      "company": "Tek Systems",
      "position": "Field rollout support",
      "website": "https://www.teksystems.com",
      "startDate": "1998-12-01",
      "endDate": "1999-07-01",
      "summary": "Provide rollout services and support to the Frito-Lay division of PepsiCo.",
      "highlights": [
        "Led a team of contractors to upgrade all desktops, laptops, and servers at Frito-Lay Manufacturing sites (OS/2 Warp Server, OS/2 Warp 4.0 workstation, Windows NT 4.0 workstation).",
        "Supported 250 Frito-Lay distribution centers as they were upgraded to OS/2 Warp Server, OS/2 Warp 4.0 workstation, and Windows NT 4.0 workstation.",
        "Helped develop a more efficient upgrade processes to be used in nearly 250 Frito-Lay area offices, manufacturing sites, and distribution centers leading to less downtime and quicker conversions from old to new servers."
      ]
    }
  ],
  "volunteer": [{
    "organization": "SYA Soccer",
    "position": "Vice President",
    "website": "https://syasoccer.org",
    "startDate": "2013-10-01",
    "endDate": "2015-08-01",
    "summary": "Vice President on the board of SYA soccer focused on the recreational soccer program.",
    "highlights": [
      "Awarded 'Volunteer of the Year 2015'"
      ]
    },
    {
      "organization": "SYA Soccer",
      "position": "Website Administrator",
      "website": "https://syasoccer.org",
      "startDate": "2012-08-01",
      "endDate": "2013-12-01",
      "summary": "Website Administrator responsiple with posting new articles and updateing the backend CMS.",
      "highlights": [
        "Awarded 'Volunteer of the Year 2013'"
      ]
    }
    ],
  "education": [],
  "skills": [
    {
      "name": "Technical Competencies",
      "level": "Master",
      "keywords": [
        "Linux/Windows",
        "Packer",
        "Terraform",
        "Ansible",
        "Docker",
        "Dual-Stack IPv4 & IPv6",
        "Grafana",
        "Zabbix",
        "Zerto",
        "PowerShell"
      ]
    },
    {
      "name": "Cloud Architecture",
      "level": "Master",
      "keywords": [
        "AWS:IAM",
        "AWS:CloudFormation",
        "AWS:VPC",
        "AWS:EC2",
        "AWS:RDS",
        "AWS:ALB",
        "AWS:ClassicELB",
        "AWS:NLB",
        "AWS:Route53",
        "AWS:S3",
        "AWS:CertificateManager",
        "AWS:CloudFront",
        "AWS:DirectConnect",
        "AWS:EFS",
        "cfn-init"
      ]
    },
    {
      "name": "CI/CD",
      "level": "Advanced",
      "keywords": [
        "Jenkins",
        "AWS:CodeBuild",
        "AWS:CodePipeline",
        "AWS:CodeCommit"
      ]
    },
    {
      "name": "On-Premises Architecture",
      "level": "Master",
      "keywords": [
        "VMWawre",
        "Cisco UCS",
        "Cisco MDS",
        "HPE Nimble",
        "KVM",
        "Ubiquiti Unifi"
      ]
    },
    {
      "name": "VMWare",
      "level": "Master",
      "keywords": [
        "ESXi",
        "vCenter",
        "Horizon",
        "vROPS"
      ]
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Native speaker"
    }
  ],
  "interests": []
}